-- Р¤Р»Р°Рі РїРѕРґРґРµСЂР¶Р°РЅРёСЏ СЂР°Р±РѕС‚С‹ СЃРєСЂРёРїС‚Р°
IsRun = true;
 
function main()
   -- РџС‹С‚Р°РµС‚СЃСЏ РѕС‚РєСЂС‹С‚СЊ С„Р°Р№Р» РІ СЂРµР¶РёРјРµ "С‡С‚РµРЅРёСЏ/Р·Р°РїРёСЃРё"
   f = io.open(getScriptPath().."\\Test.txt","r+");
   -- Р•СЃР»Рё С„Р°Р№Р» РЅРµ СЃСѓС‰РµСЃС‚РІСѓРµС‚
   if f == nil then 
      -- РЎРѕР·РґР°РµС‚ С„Р°Р№Р» РІ СЂРµР¶РёРјРµ "Р·Р°РїРёСЃРё"
      f = io.open(getScriptPath().."\\Test.txt","w"); 
      -- Р—Р°РєСЂС‹РІР°РµС‚ С„Р°Р№Р»
      f:close();
      -- РћС‚РєСЂС‹РІР°РµС‚ СѓР¶Рµ СЃСѓС‰РµСЃС‚РІСѓСЋС‰РёР№ С„Р°Р№Р» РІ СЂРµР¶РёРјРµ "С‡С‚РµРЅРёСЏ/Р·Р°РїРёСЃРё"
      f = io.open(getScriptPath().."\\Test.txt","r+");
   end;
   
   -- Р—Р°РїРёСЃС‹РІР°РµС‚ РІ С„Р°Р№Р» 2 СЃС‚СЂРѕРєРё
   f:write("Line1\nLine2"); -- "\n" РїСЂРёР·РЅР°Рє РєРѕРЅС†Р° СЃС‚СЂРѕРєРё
   -- РЎРѕС…СЂР°РЅСЏРµС‚ РёР·РјРµРЅРµРЅРёСЏ РІ С„Р°Р№Р»Рµ
   f:flush();
   -- Р’СЃС‚Р°РµС‚ РІ РЅР°С‡Р°Р»Рѕ С„Р°Р№Р»Р° 
      -- 1-С‹Рј РїР°СЂР°РјРµС‚СЂРѕРј Р·Р°РґР°РµС‚СЃСЏ РѕС‚РЅРѕСЃРёС‚РµР»СЊРЅРѕ С‡РµРіРѕ Р±СѓРґРµС‚ СЃРјРµС‰РµРЅРёРµ: "set" - РЅР°С‡Р°Р»Рѕ, "cur" - С‚РµРєСѓС‰Р°СЏ РїРѕР·РёС†РёСЏ, "end" - РєРѕРЅРµС† С„Р°Р№Р»Р°
      -- 2-С‹Рј РїР°СЂР°РјРµС‚СЂРѕРј Р·Р°РґР°РµС‚СЃСЏ СЃРјРµС‰РµРЅРёРµ
   f:seek("set",0);
   -- РџРµСЂРµР±РёСЂР°РµС‚ СЃС‚СЂРѕРєРё С„Р°Р№Р»Р°, РІС‹РІРѕРґРёС‚ РёС… СЃРѕРґРµСЂР¶РёРјРѕРµ РІ СЃРѕРѕР±С‰РµРЅРёСЏС…
   for line in f:lines() do message(tostring(line));end
   -- Р—Р°РєСЂС‹РІР°РµС‚ С„Р°Р№Р»
   f:close();
   -- Р¦РёРєР» Р±СѓРґРµС‚ РІС‹РїРѕР»РЅСЏС‚СЃСЏ, РїРѕРєР° IsRun == true
   while IsRun do
      sleep(100);
   end;   
end;
 
function OnStop()
   IsRun = false;
end;